; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v10 ?v4)
             (pred_8 ?v8 ?v7)
             (pred_2 ?v10 ?v7)
             (pred_11 ?v5 ?v10 )
	     (pred_9 ?v10)
             (pred_6 ?v1)
             (pred_12 ?v8)
             (pred_3 ?v7)
             (pred_1 ?v10)
             (pred_10 ?v8)
             (pred_4 ?v10)
             (pred_7 ))



(:action op_2
:parameters (?v12 ?v13 ?v2 ?v11)
:precondition (and (pred_6 ?v12) (pred_6 ?v13) (pred_12 ?v2) (pred_3 ?v11)
          (pred_5 ?v12 ?v13) (pred_8 ?v2 ?v11)
                   (pred_2 ?v13 ?v11) (pred_9 ?v12) 
                   (pred_1 ?v13) (pred_10 ?v2))
:effect (and  (pred_4 ?v13) (not (pred_1 ?v13))))


(:action op_3
:parameters (?v12 ?v9)
:precondition (and (pred_6 ?v12) (pred_6 ?v9)
               (pred_9 ?v12) (pred_5 ?v12 ?v9) (pred_4 ?v9))
:effect (and (pred_9 ?v9) (not (pred_9 ?v12))))

(:action op_5
:parameters (?v12 ?v2)
:precondition (and (pred_6 ?v12) (pred_12 ?v2) 
                  (pred_9 ?v12) (pred_11 ?v2 ?v12) (pred_7 ))
:effect (and (pred_10 ?v2)
   (not (pred_11 ?v2 ?v12)) (not (pred_7 ))))


(:action op_4
:parameters (?v12 ?v3 ?v6)
:precondition (and (pred_6 ?v12) (pred_12 ?v3) (pred_12 ?v6)
                  (pred_9 ?v12) (pred_10 ?v6) (pred_11 ?v3 ?v12))
:effect (and (pred_10 ?v3) (pred_11 ?v6 ?v12)
        (not (pred_10 ?v6)) (not (pred_11 ?v3 ?v12))))

(:action op_1
:parameters (?v12 ?v2)
:precondition (and (pred_6 ?v12) (pred_12 ?v2) 
                  (pred_9 ?v12) (pred_10 ?v2))
:effect (and (pred_7 ) (pred_11 ?v2 ?v12) (not (pred_10 ?v2)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_19 obj_11 obj_01 obj_18 obj_08 obj_04 obj_09 obj_17 obj_15 obj_20 obj_16 obj_13 obj_14 obj_12 obj_07
    obj_06 obj_03
    obj_02 obj_05
    )

    (:init
       (pred_7)

       (pred_6 obj_10)
       (pred_6 obj_19)
       (pred_6 obj_11)
       (pred_6 obj_01)
       (pred_6 obj_18)
       (pred_6 obj_08)
       (pred_6 obj_04)
       (pred_6 obj_09)
       (pred_6 obj_17)
       (pred_6 obj_15)
       (pred_6 obj_20)
       (pred_6 obj_16)
       (pred_6 obj_13)
       (pred_6 obj_14)
       (pred_6 obj_12)
       (pred_6 obj_07)
       (pred_3 obj_06)
       (pred_3 obj_03)
       (pred_12 obj_02)
       (pred_12 obj_05)

       (pred_5 obj_10 obj_18)
       (pred_5 obj_10 obj_19)
       (pred_5 obj_19 obj_08)
       (pred_5 obj_19 obj_11)
       (pred_5 obj_19 obj_10)
       (pred_5 obj_11 obj_04)
       (pred_5 obj_11 obj_01)
       (pred_5 obj_11 obj_19)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_01 obj_11)
       (pred_5 obj_18 obj_17)
       (pred_5 obj_18 obj_08)
       (pred_5 obj_18 obj_10)
       (pred_5 obj_08 obj_15)
       (pred_5 obj_08 obj_04)
       (pred_5 obj_08 obj_19)
       (pred_5 obj_08 obj_18)
       (pred_5 obj_04 obj_20)
       (pred_5 obj_04 obj_09)
       (pred_5 obj_04 obj_11)
       (pred_5 obj_04 obj_08)
       (pred_5 obj_09 obj_16)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_17 obj_13)
       (pred_5 obj_17 obj_15)
       (pred_5 obj_17 obj_18)
       (pred_5 obj_15 obj_14)
       (pred_5 obj_15 obj_20)
       (pred_5 obj_15 obj_08)
       (pred_5 obj_15 obj_17)
       (pred_5 obj_20 obj_12)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_20 obj_04)
       (pred_5 obj_20 obj_15)
       (pred_5 obj_16 obj_07)
       (pred_5 obj_16 obj_09)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_13 obj_14)
       (pred_5 obj_13 obj_17)
       (pred_5 obj_14 obj_12)
       (pred_5 obj_14 obj_15)
       (pred_5 obj_14 obj_13)
       (pred_5 obj_12 obj_07)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_12 obj_14)
       (pred_5 obj_07 obj_16)
       (pred_5 obj_07 obj_12)
       (pred_1 obj_14)
       (pred_1 obj_19)
       (pred_2  obj_14 obj_06)
       (pred_2  obj_19 obj_03)
       (pred_4 obj_10)
       (pred_4 obj_11)
       (pred_4 obj_01)
       (pred_4 obj_18)
       (pred_4 obj_08)
       (pred_4 obj_04)
       (pred_4 obj_09)
       (pred_4 obj_17)
       (pred_4 obj_15)
       (pred_4 obj_20)
       (pred_4 obj_16)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_07)

       (pred_8  obj_02 obj_06)
       (pred_8  obj_05 obj_03)
       (pred_11 obj_02 obj_01)
       (pred_11 obj_05 obj_18)
       (pred_9 obj_15)
    )

    (:goal (and
       (pred_11 obj_02 obj_11)
    ))
(:constraints
  (always (not (pred_9 obj_04)))
)
)

; plan
1. (op_3 obj_15 obj_20)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_20)
   goals met: 0 of 1
2. (op_3 obj_20 obj_16)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_16)
   goals met: 0 of 1
3. (op_3 obj_16 obj_09)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_09)
   goals met: 0 of 1
4. (op_3 obj_09 obj_01)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_01)
   goals met: 0 of 1
5. (op_5 obj_01 obj_02)
   deleted: (pred_11 obj_02 obj_01) (pred_7)
   added: (pred_10 obj_02)
   goals met: 0 of 1
6. (op_3 obj_01 obj_11)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_11)
   goals met: 0 of 1
7. (op_1 obj_11 obj_02)
   deleted: (pred_10 obj_02)
   added: (pred_7) (pred_11 obj_02 obj_11)
   goals met: 1 of 1
